{
  "name": "Levy Nkeneng",
  "location": "Berlin, Germany",
  "email": "contact@levynkeneng.dev",
  "github": "https://github.com/LinkNexus",
  "linkedin": "https://www.linkedin.com/in/levy-nkeneng-2b977a304",
  "speech": "🚀 Passionate software engineer with a versatile skill set spanning multiple domains. I thrive on solving complex challenges across different platforms and environments, adapting quickly to new technologies and methodologies. My holistic approach combines technical expertise with creative problem-solving, allowing me to develop solutions that are both innovative and practical. I'm driven by continuous learning and a commitment to excellence, whether working independently or collaborating with diverse teams to create impactful, scalable solutions.",
  "layout": {
    "title": "Levy Nkeneng's Portfolio",
    "description": "Explore the professional portfolio of Levy Nkeneng, a skilled web developer and software engineer specializing in modern frontend and backend technologies. Discover projects, skills, and experience in JavaScript, TypeScript, Astro, React, and more."
  },
  "workExperience": [
    {
      "company": "Web Loupe GmbH",
      "location": "Berlin, Germany",
      "position": "Werkstudent Web Developer",
      "period": "August 2024 - Present",
      "achievements": [
        "Created a range of client e-commerce websites using Shopware 6, Symfony and Webpack",
        "Developed custom plugins and themes to enhance functionality and user experience.",
        "Collaborated with designers to implement responsive and visually appealing user interfaces.",
        "Managed twig templates and integrated them with Shopware's backend systems."
      ]
    }
  ],
  "skills": {
    "Programming Languages": {
      "emoji": "💻",
      "list": [
        "TypeScript",
        "C# and .NET",
        "PHP"
      ]
    },
    "Frontend Development": {
      "emoji": "🎨",
      "list": [
        "ViteJs",
        "Nextjs",
        "Reactjs",
        "AlpineJs",
        "Shadcn UI",
        "Tailwind CSS",
        "Wouter"
      ]
    },
    "Backend Development": {
      "emoji": "⚙️",
      "list": [
        "Nodejs",
        "Fastify",
        "PHP",
        "Symfony",
        "Shopware 6",
        "Laravel"
      ]
    },
    "Database & Storage": {
      "emoji": "🗄️",
      "list": [
        "PostgreSQL",
        "Doctrine (ORM)",
        "Eloquent ORM",
        "MySQL",
        "SQLite"
      ]
    },
    "DevOps": {
      "emoji": "☁️",
      "list": [
        "Docker",
        "Docker Compose",
        "CI/CD",
        "Dokploy",
        "Traefik",
        "Cloudflare",
        "Ansible"
      ]
    },
    "Tools & Services": {
      "emoji": "🧰",
      "list": [
        "Git",
        "IDEs (VSCode, PHPStorm...)",
        "Fish Terminal",
        "Warp Terminal"
      ]
    }
  },
  "projects": [
    {
      "title": "GamersWorld",
      "github": "https://github.com/LinkNexus/GamersWorld.git",
      "description": [
        "A Symfony-based web application created for playing simple games.",
        "Supports Tic-Tac-Toe, Rock-Paper-Scissors, and other casual games.",
        "Offers multiple modes: Solo play, AI opponent, or online matches against other players.",
        "Symfony & PHP are used to handle server requests efficiently.",
        "Messenger manages asynchronous tasks such as email dispatching.",
        "Mercure is utilized for real-time one-way communication between clients and the server.",
        "Files are served via the Caddy server, ensuring fast and secure delivery.",
        "FrankenPHP runs in worker mode, optimizing PHP processing for high performance."
      ],
      "demo": "https://games.levynkeneng.dev"
    },
    {
      "title": "ApiTester.JS",
      "github": "https://github.com/LinkNexus/APITester.Js",
      "description": [
        "A Node.js-based tool designed for quickly sending requests to an endpoint.",
        "Supports both HTTP and Server-Sent Events (SSE) for versatile testing.",
        "Useful for testing endpoints during development or analyzing response structures.",
        "Allows sending requests with both text-based and file-based bodies.",
        "Provides flexibility in simulating different API interactions."
      ]
    },
    {
      "title": "Blitz Task",
      "github": "https://github.com/LinkNexus/blitz-task",
      "description": [
        "A task management application built with React, Vite.js, and TypeScript.",
        "Task Management is powered by PHP and Symfony, ensuring robust backend functionality.",
        "Utilizes Shadcn UI for a modern and responsive user interface.",
        "Features a Kanban board for organizing tasks, enhancing productivity.",
        "Ideal for teams looking to streamline their workflow and task assignments."
      ]
    },
    {
      "title": "InstaChat",
      "github": "https://github.com/LinkNexus/instaChat",
      "description": [
        "A simple messaging system built on the popular React framework.",
        "ViteJs establishes the frontend architecture of the system with client-side routing using Wouter.",
        "Symfony and Mercure form the core of the server-side functionality.",
        "These technologies enable real-time data transmission to the client."
      ]
    },
    {
      "title": "CondaAI",
      "github": "https://github.com/LinkNexus/team-anaconda",
      "description": [
        "Conda AI is a project that aims to provide a user-friendly To-Do list application with AI capabilities to improve the overview of tasks and their completion.",
        "The application is built using .Net Maui and utilizes the MVVM pattern for a clean separation of code.",
        "It features a user-friendly interface with a dark mode option, enhancing usability and accessibility."
      ]
    }
  ],
  "education": [
    {
      "institution": "Hochschule für Technik und Wirtschaft Berlin",
      "location": "Berlin, Germany",
      "degree": "Currently studying for a Bachelor's in Ingenieurinformatik",
      "period": "April 2024 - Present",
      "achievements": []
    }
  ]
}
